INITIAL_DATA = [
    ("Михайлов И.И.", "Машкалова П.П.", 1, "Классическая мужская", 500.0),
    ("Осинская А.А.", "Осадчий М.М.", 2, "Каре", 800.0),
    ("Михайлов И.И.", "Шипило С.С.", 1, "Фейд", 600.0),
    ("Шипило А.А.", "Новикова Е.Е.", 1, "Каскад", 900.0),
    ("Оганисян Д.Д.", "Кухнин Н.Н.", 1, "Бокс", 400.0),
    ("Оганисян А.А.", "Топоркова О.О.", 1, "Укладка", 700.0),
    ("Кухнин И.И.", "Оганисян А.А.", 1, "Полубокс", 550.0),
    ("Белов Д.Д.", "Кухнин Т.Т.", 1, "Стрижка челки", 300.0),
    ("Шипило А.А.", "Михайлов И.И.", 1, "Окрашивание", 1500.0),
    ("Кухнин И.И.", "Сергеева В.В.", 1, "Бритье", 350.0),
]